Autodesk.Revit.DB.City.TimeZone
Time-zone in which the city resides
Remarks: A read only property that returns the time zone in which the city resides.
The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.

Autodesk.Revit.DB.City.Longitude
Longitude of the city
Remarks: A read only property that contains the longitude of the city.
The value returned is in radians, ranging from -PI to +PI.

Autodesk.Revit.DB.City.Latitude
Latitude of the city
Remarks: A read only property that contains the latitude of the city.
The value returned is in radians, ranging from -PI to +PI.

Autodesk.Revit.DB.City.WeatherStation
An identifier for the nearest weather station
Remarks: A read only string property that contains an identifier of the nearest weather station.
Since: 2011

Autodesk.Revit.DB.City.Name
The name of the city
Remarks: A read only string property that contains the name of the city, such as Boston.

Autodesk.Revit.DB.City
An object that contains geographical location information for a known city.
Remarks: This object contains longitude, latitude, time zone information for a city already known by Revit.
Currently Revit does not the ability to add cities to the existing list. The list of known cities can be
retrieved using the Cities property on the application object.